from time import *
from random import *
box = 0
gems = 50000
pol = 0
reclam = 0
rec = 0
lobik = 0
b = 1
li = 0
il = 0
bll = 1
geka = 0
bomb = 0
mol = 0
vana = 0
def vanja():
    print('''
    ------------------------------------------------
    ###########
    ###########      ##          ваня одыкватный
    #O#######O#      ##              лега
    ###########    ######        водка или ничего?
    ###########    ######
    #^^^^^^^^^#    ######
    ###########    ######
    -------------------------------------------------
    ''')
def vanja2():
    print('''
    ------------------------------------------------
    ###########
    ###########      ##          
    #O#######O#      ##              
    ###########    ######        
    ###########    ######
    #^^^^^^^^^#    ######
    ###########    ######
    -------------------------------------------------
    ''')
def epic2():
    print('''
    -------------------
         ####
        ####
       ####
    ##########     бомба
    ##########      эпик
    ##########     я бомба!!!!(или мина?)
    ##########
    ---------------------
    ''')
def epic23():
    print('''
    -------------------
         ####
        ####
       ####
    ##########     
    ##########      
    ##########     
    ##########
    ---------------------
    ''')
def lob():
	print('''
	-----------------
	  #######
	 #########
	###########
	###########     яйцо
	 #########   сверхредкий
	  #######      я яйцо!!!!!!!!!!
	  -----------------
	''')
def lob2():
	print('''
	-----------------
	  #######
	 #########
	###########
	###########      
	 #########     
	  #######
	  ----------------      
	''')
def poll():
	print('''
	----------------
	#########
	#########           пол
	#########            эпик
	OOOOOOOOO     я полик пол не пол пол!!!!
	----------------
	''')
def poll2():
	print('''
	----------------
	#########
	#########           
	#########            
	OOOOOOOOO
	----------------
	''')
print('''
-----------------
###     ###
###########
###  #  ###
###  #  ###
molni

babl molni
------------------
''')
sleep(2)
print('если падает повторка как новый бравлер, столько солько цифр в управлении столько и бравлеров')
sleep(3)
def g():
	print('''
	---------
	#######
	#######               унитаз шрека
	#######                    лега
	##########          я тубзик,а ты?!
	##########
	##########
	----------
	''')
def g2():
	print('''
	----------------------
	#######
	#######              
	#######                    
	##########          
	##########
	##########
	----------------------
	''')
def moll():
	print('''
	--------------------
	#######
	#######     камень
	#######       сверхредкий
	#######     а что тут говорить я камень?!
	------------------
	''')
def moll2():
	print('''
	-------------------
	#######
	#######     
	#######       
	#######    
	------------------ 
	''')
def recll():
    print('''
    ----------------
    ######
    ######
        ##
        ##
        ##
        #######
        #######
        ##   ##
        ##   ##
        #######
        #######
    TIk TOK
    ----------------
    ''')
def kll3():
    print('''
   ------------------
   #####
   #O#O#
   #####
   ########
   ####
   ####
   ## ##
   ## ##   просто д.
   ## ##     лега
   ## ##    я зомби ээээээ!
   -------------------
   ''')
def kll2():
    print('''
   ------------------
   #####
   #O#O#
   #####
   ########
   ####
   ####
   ## ##
   ## ##   
   ## ##     
   ## ##
   --------------------
   ''')
def gamm():
    print('''
    ----------------
      #######
     #########
    ###########
     #########
      #######

      12 гемов
      выпало
      
      воу воу гемасик мой
      ой ой ой
      без обид
      я гемасик
      очень крутой
      без обид
      на обид
      дай бабла
      да да да
    ----------------
    ''')
def epic():
    print('''
     ----------------
     ########
     ########
     #==#==#####
     ###########   amogus
     ###########    эпик
     ####  ####    ту-туту-амогус я воу
     ------------------
     ''')
def rt():
    print('''
    --------------
    ###########
    ####$$$$###
    ####$$$$###
    ###########
    ###########
    ---------------
    ''')
def rt2():
    print('''
    --------------
    ###########      * * * 
    ####$$$$###
    ####$$$$###   ////
    ###########
    ###########
    ---------------
    ''')
def rt3():
    print('''
    --------------
    ###########
    ####$$$$###
                 ***
    
    ####$$$$###
    ###########
    ###########
    ---------------
    ''')
def k1():
    print('''
    ------------
    ###########
    ######**###
    ##############
    ##############
     ####    ###
     ####    ###
    ---------------
    ''')
def l2():
    print('''
    -------------------
    ###########
    #==####==#####
    ##############
    ##############
    ###########
    ####   ####
    ####   ####
    ###    ####
    ---------------
    ''')
def upr():
    print('''
    ------------
    m = магазин,
    r = бег на гемы(пока нету),
    b = открыть сундук,
    f = сколько бойцов гемов и тд.,
    1 = выбрать первого бойца,
    2 = второго бойца,
    upr = управление,
    3 = вызвать третего бойца,
    4 = взять четвёртого бойца,
    5 = взять пятого юайца,
    6 = взять шестого бойца,
    7 = взять седьмого бойца,
    8 = взять восьмого бойца,
    9 = взять девятого бойца.
    --------------
    ''')
upr()
while True:
    l = input('действие: ')
    if l == '9':
        if vana < 1:
            print('у тебя нету такого бойца!!!')
        else:
            vanja2()
    if l == '8':
        if bomb < 1:
            print('у тебя нету такого бойца!')
        else:
            epic23()
    if l == '7':
    	if lobik < 1:
    		print('утебя нет такого бойца')
    	else:
    	   lob2()
    if l == '6':
    	if pol < 1:
    		print('у тебя нет такого бойца')
    	else:
    		poll2()
    if l == '5':
    	if geka < 1:
    		print('нет такого бойца у тебя')
    	else:
    	    g2()
    if reclam == 3:
        gems += 310
        reclam = 0
    if l == '4':
    	if mol < 1:
    	    print('этого бойца нету')
    	else:
    	    moll2()
    if l == '3':
        if il < 1:
            print('извини но такого бойца нет!')
        else:
            kll2()
    if l == '1':
        if b < 1:
            print('иззвини но этого бойца  нет')
        else:
            k1()
    if l == '2':
        if li < 1:
            print('извини но этого бойца нет')
        else:
            l2()
    if l == 'b':
        if box < 1:
            print('нет сундуков')
        else:
            rt()
            sleep(1)
            rt2()
            sleep(1)
            rt3()
            k = randint(1, 17)
            box -= 1
            if k == 12:
                vanja()
                vana += 1
                bll += 1
            if k == 15:
                epic2()
                bll += 1
                bomb += 1
            if k == 13:
            	lob()
            	lobik += 1
            	bll += 1
            if k == 10:
            	poll()
            	pol += 1
            if k == 7:
            	g()
            	geka += 1
            	bll += 1
            if k == 6:
            	bll += 1
            	mol += 1
            	moll()
            if k == 4:
                bll +=1
                kll3()
                il += 1
            if k == 3:
               li += 1
               bll += 1
               epic()
               print('боец (эпик)')
            if k == 2:
                print('+12 гемов')
                gems += 12
                gamm()
    if l == 'f':
        print('бойцы: ', bll)
        print('гемы: ', gems)
        print('рекламы: ', rec)
    if l == 'upr':
        upr()
    if l == 'm':
        print('''
        -----------
        l = промотреть рекламу(3 рекламы) на 310 гемов,
        j = купить сундук за 25 гемов.
        ---------------
        ''')
        jk = input('что купишь: ')
        if jk == 'l':
            rec += 1
            for i in range(15):
                recll()
                print('tik tok')
                sleep(1)
            reclam += 1
        if jk == 'j':
            if gems < 25:
                print('нет денег')
            else:
                gems -= 25
                box += 1
                print('сундук куплен!')
    if l == 'upr':
        upr()